app/Views/operator/dashboard.php

SELECT *
FROM `akun`
WHERE `role` = 'operator'
---
                            </thead>
                            <tbody>
                                <?php
                                $data = $akunModel->where('role', 'operator')->findAll();

SELECT *
FROM `akun`
WHERE `role` = 'admin'
---
                            </thead>
                            <tbody>
                                <?php
                                $data = $akunModel->where('role', 'admin')->findAll();

SELECT *
FROM `akun`
INNER JOIN `mahasiswa` ON `mahasiswa`.`idakun` = `akun`.`idakun`
WHERE `role` = 'mahasiswa'
---
                            </thead>
                            <tbody>
                                <?php
                                $data = $akunModel->where('role', 'mahasiswa')->join('mahasiswa', 'mahasiswa.idakun = akun.idakun', 'inner')->findAll();