app/Controllers/Controllers.php

INSERT INTO `akun` (`username`, `password`, `role`) VALUES ('Laravel', '$2y$10$t87vu1POiZPKAhQp7qgt6OXONulj2mlpuZvnHmSXAbaFiV36Dojq6', 'mahasiswa')
INSERT INTO `mahasiswa` (`idakun`, `namamhs`) VALUES (11, 'Laravel')
---
    public function addAkunAction()
    {
        $role = $this->request->getPost('role');
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $password = password_hash(strval($password), PASSWORD_BCRYPT);

        if (!in_array($role, ['mahasiswa', 'admin', 'operator'])) {
            return redirect()->back()->withInput()->with('error', 'Role tidak valid');
        }

        if ($role == 'mahasiswa') {
            $namamhs = $this->request->getPost('namamhs');

            if (empty($namamhs)) {
                return redirect()->back()->withInput()->with('error', 'Nama mahasiswa diperlukan');
            }
        }

        if (empty($username)) {
            return redirect()->back()->withInput()->with('error', 'Username diperlukan');
        }

        if (empty($password)) {
            return redirect()->back()->withInput()->with('error', 'Password diperlukan');
        }

        $this->akunModel->insert([
            'username' => $username,
            'password' => $password,
            'role' => $role,
        ]);

        if ($role == 'mahasiswa') {
            $id = $this->akunModel->insertID();
            $this->mahasiswaModel->insert([
                'idakun' => $id,
                'namamhs' => $namamhs
            ]);